import gardnerImage from "../assets/images/banner/gardner.png";

export const courseData = [
    {
        id: 1,
        title: "1 دوره کنترل خشم",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "60",
        participants: 128,
        badge: "ویژه والدین و فرزندان",
        category: "سبک زندگی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 2,
        title: "دوره کنترل خشم 2",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "30",
        participants: 128,
        badge: "ویژه والدین",
        category: "شخصیت شناسی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 3,
        title: "دوره کنترل خشم 3",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "120",
        participants: 128,
        badge: "ویژه والدین",
        category: "سبک زندگی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 4,
        title: "دوره کنترل خشم 4",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "45",
        participants: 128,
        badge: "ویژه فرزندان",
        category: "اختلالات رفتاری",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 5,
        title: "دوره کنترل خشم 5",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "90",
        participants: 128,
        badge: "ویژه فرزندان",
        category: "شخصیت شناسی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 6,
        title: "دوره کنترل خشم 6",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "40",
        participants: 128,
        badge: "ویژه والدین و فرزندان",
        category: "شخصیت شناسی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 7,
        title: "دوره کنترل خشم 7",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "110",
        participants: 128,
        badge: "ویژه والدین",
        category: "شخصیت شناسی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 8,
        title: "دوره کنترل خشم 8",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "90",
        participants: 128,
        badge: "ویژه فرزندان",
        category: "خانواده",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 9,
        title: "9 دوره کنترل خشم",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "90",
        participants: 128,
        badge: "ویژه والدین",
        category: "سبک زندگی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 10,
        title: "دوره کنترل خشم 10",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "100",
        participants: 128,
        badge: "ویژه فرزندان",
        category: "شخصیت شناسی",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 11,
        title: "دوره کنترل خشم 11",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "120",
        participants: 128,
        badge: "ویژه والدین",
        category: "خانواده",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 12,
        title: "12 دوره کنترل خشم",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "35",
        participants: 128,
        badge: "ویژه والدین و فرزندان",
        category: "اضطراب",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 13,
        title: "دوره کنترل خشم 13",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "50",
        participants: 128,
        badge: "ویژه والدین",
        category: "اضطراب",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
    {
        id: 14,
        title: "دوره کنترل خشم 14",
        description: "خشم یکی از طبیعی‌ترین احساسات انسانی است که در واکنش به ناکامی، تهدید یا بی‌عدالتی پدید می‌آید. اما زمانی که این احساس کنترل‌نشده بروز کند، می‌تواند به روابط فردی، شغلی و حتی سلامت جسمی آسیب بزند. شناخت دلایل ریشه‌ای خشم—مانند زخم‌های گذشته، احساس نادیده‌گرفته‌شدن یا استرس‌های انباشته—گام اول در مسیر مدیریت آن است. ",
        image: gardnerImage,
        time: "40",
        participants: 128,
        badge: "خانواده",
        category: "اختلالات رفتاری",
        price: 1000000,
        rating: 1,
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ]
    },
]