import gardnerImage from "../assets/images/banner/gardner.png"

export const examsData = [
    {
        id: 1,
        title: "آزمون هوش کودکان",
        description: "یک آزمون جامع برای سنجش هوش کودکان",
        image: "/uploads/images/file-1734567890123-123456789.jpg",
        time: "30",
        participants: 128,
        questionsCount: 40,
        target_audience: "ویژه والدین",
        category: "اختلال خواندن",
        age_range: "3-12",
        price: "1000000",
        rating: "1",
        suitableFor: [
            "افراد زودرنج",
            "والدین حساس",
            "کودکان با نیازهای ویژه",
            "علاقه‌مندان به روانشناسی کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون خیلی خوب و جامع بود." },
            { name: "آرمیتا احمدی", comment: "سوالات مناسبی داشت و کمک کننده بود." },
            { name: "آرمیتا احمدی", comment: "به والدین توصیه می‌کنم این آزمون را انجام دهند." },
            { name: "آرمیتا احمدی", comment: "بعضی سوالات کمی سخت بود ولی کلی خوب بود." },
            { name: "آرمیتا احمدی", comment: "نتیجه آزمون برای من جالب و آموزنده بود." }
        ],
        tags: ["خانواده", "زندگی سالم", "محبت", "والدین حساس"],
        created_at: "2025-07-15T10:51:07Z",
    },
    {
        id: 2,
        title: "آزمون استعدادسنجی نوجوانان",
        description: "ارزیابی استعدادهای مختلف نوجوانان",
        image: "/uploads/images/file-1734567890124-123456790.jpg",
        time: "45",
        participants: 90,
        questionsCount: 50,
        target_audience: "ویژه فرزندان",
        category: "اختلال نوشتن",
        age_range: "13-18",
        price: "2000000",
        rating: "4",
        suitableFor: [
            "نوجوانان علاقه‌مند به شناخت استعداد",
            "والدین دغدغه‌مند",
            "مشاوران تحصیلی",
            "مدرسین و مربیان"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "این آزمون کمک کرد استعدادهای پسرم را بهتر بشناسم.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "خیلی کاربردی و روان بود.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "امتیاز ۵ از ۵ به این آزمون می‌دهم.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "سوالات به خوبی دسته‌بندی شده بودند.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "من و فرزندم راضی بودیم.", "created_at": "2025-06-02T14:30:00Z" }
        ],
        faq: [
            {
                question: "این آزمون برای چه رده سنی مناسب است؟",
                answer: "این آزمون برای والدین و فرزندان بالای ۷ سال طراحی شده است."
            },
            {
                question: "آیا نتیجه آزمون تحلیل هم دارد؟",
                answer: "بله، پس از پایان آزمون، تحلیلی کامل بر اساس پاسخ‌های شما ارائه می‌شود."
            },
            {
                question: "چقدر زمان برای پاسخ دادن لازم است؟",
                answer: "حدود ۶۰ دقیقه، اما بسته به سرعت فرد ممکن است کمتر یا بیشتر شود."
            }
        ],
        tags: ["خانواده", "زندگی سالم", "محبت", "والدین حساس"],
        created_at: "2025-07-09T19:48:07Z",

    },
    {
        id: 3,
        title: "آزمون ترکیبی خانواده",
        description: "تست MBTI ابزاری است که برای به دست آوردن بینش در مورد ویژگی های شخصیتی فرد استفاده می شود. با درک سبک  آزمونی برای والدین و فرزندان به صورت مشترک آزمونی برای والدین و فرزندان به صورت مشترک  آزمونی برای والدین و فرزندان به صورت مشترک  آزمونی برای والدین و فرزندان به صورت مشترک",
        video: "https://interactive-examples.mdn.mozilla.net/media/cc0-videos/flower.mp4",
        image: gardnerImage,
        time: "60",
        participants: 150,
        questionsCount: 60,
        target_audience: "ویژه والدین و فرزندان",
        category: "اختلال خواندن",
        age_range: "3-18",
        price: "1100000",
        rating: "3",
        suitableFor: [
            "والدین نگران",
            "فرزندان حساس",
            "خانواده‌های پرمشکل",
            "مشاوران خانواده"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "آزمون جامع و کاربردی بود.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "کمک بزرگی به فهم بهتر خانواده ما کرد.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "مناسب برای همه اعضای خانواده.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "خیلی راحت و روان طراحی شده بود.", "created_at": "2025-06-02T14:30:00Z" },
            { name: "آرمیتا احمدی", comment: "پیشنهاد می‌کنم همه خانواده‌ها انجام دهند.", "created_at": "2025-06-02T14:30:00Z" }
        ],
        faq: [
            {
                question: "این آزمون برای چه رده سنی مناسب است؟",
                answer: "این آزمون برای والدین و فرزندان بالای ۷ سال طراحی شده است."
            },
            {
                question: "آیا نتیجه آزمون تحلیل هم دارد؟",
                answer: "بله، پس از پایان آزمون، تحلیلی کامل بر اساس پاسخ‌های شما ارائه می‌شود."
            },
            {
                question: "چقدر زمان برای پاسخ دادن لازم است؟",
                answer: "حدود ۶۰ دقیقه، اما بسته به سرعت فرد ممکن است کمتر یا بیشتر شود."
            }
        ],
        tags: ["خانواده", "زندگی سالم", "محبت", "والدین حساس"],
        created_at: "2025-07-11T13:21:07Z",
    },
    {
        id: 4,
        title: "آزمون هوش کودکان",
        description: "یک آزمون جامع برای سنجش هوش کودکان",
        image: gardnerImage,
        time: "30",
        participants: 120,
        questionsCount: 40,
        target_audience: "ویژه والدین",
        category: "اختلال خواندن",
        age_range: "3-12",
        price: "4500000",
        rating: "4",
        suitableFor: [
            "کودکان کنجکاو",
            "والدین علاقمند به رشد فرزند",
            "معلمان مهدکودک",
            "روانشناسان کودک"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "سوالات خیلی خوب و مفید بود." },
            { name: "آرمیتا احمدی", comment: "خوب طراحی شده و نتیجه‌اش دقیق بود." },
            { name: "آرمیتا احمدی", comment: "من به عنوان مادر راضی بودم." },
            { name: "آرمیتا احمدی", comment: "برای کودکان بسیار مناسب است." },
            { name: "آرمیتا احمدی", comment: "توصیه می‌کنم امتحان کنید." }
        ],
        faq: [
            {
                question: "این آزمون برای چه رده سنی مناسب است؟",
                answer: "این آزمون برای والدین و فرزندان بالای ۷ سال طراحی شده است."
            },
            {
                question: "آیا نتیجه آزمون تحلیل هم دارد؟",
                answer: "بله، پس از پایان آزمون، تحلیلی کامل بر اساس پاسخ‌های شما ارائه می‌شود."
            },
            {
                question: "چقدر زمان برای پاسخ دادن لازم است؟",
                answer: "حدود ۶۰ دقیقه، اما بسته به سرعت فرد ممکن است کمتر یا بیشتر شود."
            }
        ],
        created_at: "2025-07-11T09:42:07Z",
    },
    {
        id: 5,
        title: "آزمون استعدادسنجی نوجوانان",
        description: "ارزیابی استعدادهای مختلف نوجوانان",
        image: gardnerImage,
        time: "45",
        participants: 92,
        questionsCount: 50,
        target_audience: "ویژه فرزندان",
        category: "اختلال نوشتن",
        age_range: "13-18",
        price: "100",
        rating: "5",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-09T20:26:07Z",
    },
    {
        id: 6,
        title: "آزمون ترکیبی خانواده",
        description: "آزمونی برای والدین و فرزندان به صورت مشترک",
        image: gardnerImage,
        time: "60",
        participants: 150,
        questionsCount: 60,
        target_audience: "ویژه والدین و فرزندان",
        category: "اختلال توجه",
        age_range: "3-18",
        price: "250",
        rating: "2",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-16T07:52:07Z",
    },
    {
        id: 7,
        title: "2 آزمون هوش کودکان",
        description: "یک آزمون جامع برای سنجش هوش کودکان",
        image: gardnerImage,
        time: "30",
        participants: 184,
        questionsCount: 40,
        target_audience: "ویژه والدین",
        category: "اختلال خواندن",
        age_range: "13-18",
        price: "1250000",
        rating: "4",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-11T06:37:07Z",
    },
    {
        id: 8,
        title: " 2 آزمون استعدادسنجی نوجوانان",
        description: "ارزیابی استعدادهای مختلف نوجوانان",
        image: gardnerImage,
        time: "45",
        participants: 164,
        questionsCount: 50,
        target_audience: "ویژه فرزندان",
        category: "اختلال خواندن",
        age_range: "13-18",
        price: "2840000",
        rating: "4.5",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-13T07:48:07Z",
    },
    {
        id: 9,
        title: "2 آزمون ترکیبی خانواده",
        description: "آزمونی برای والدین و فرزندان به صورت مشترک",
        image: gardnerImage,
        time: "60",
        participants: 134,
        questionsCount: 60,
        target_audience: "ویژه والدین و فرزندان",
        category: "اختلال یادگیری",
        age_range: "3-18",
        price: "1580000",
        rating: "1.3",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-10T07:34:07Z",
    },
    {
        id: 10,
        title: "3 آزمون هوش کودکان",
        description: "یک آزمون جامع برای سنجش هوش کودکان",
        image: gardnerImage,
        time: "30",
        participants: 170,
        questionsCount: 40,
        target_audience: "ویژه والدین",
        category: "اختلال خواندن",
        age_range: "3-12",
        price: "4565000",
        rating: "2.5",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-10T08:46:07Z",
    },
    {
        id: 11,
        title: "2 آزمون استعدادسنجی نوجوانان",
        description: "ارزیابی استعدادهای مختلف نوجوانان",
        image: gardnerImage,
        time: "45",
        participants: 50,
        questionsCount: 50,
        target_audience: "ویژه فرزندان",
        category: "اختلال خواندن",
        age_range: "13-18",
        price: "1560000",
        rating: "2.9",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-12T03:04:07Z",
    },
    {
        id: 12,
        title: "2 آزمون ترکیبی خانواده",
        description: "آزمونی برای والدین و فرزندان به صورت مشترک",
        image: gardnerImage,
        time: "60",
        participants: 211,
        questionsCount: 60,
        target_audience: "ویژه فرزندان",
        category: "اختلال خواندن",
        age_range: "3-18",
        price: "350000000",
        rating: "4.6",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-14T15:10:07Z",
    },
    {
        id: 13,
        title: "3 آزمون ترکیبی خانواده",
        description: "آزمونی برای والدین و فرزندان به صورت مشترک",
        image: gardnerImage,
        time: "60",
        participants: 281,
        questionsCount: 60,
        target_audience: "ویژه والدین و فرزندان",
        category: "اختلال خواندن",
        age_range: "3-18",
        price: "45000000",
        rating: "3.4",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-11T16:04:07Z",
    },
    {
        id: 14,
        title: "4 آزمون ترکیبی خانواده",
        description: "آزمونی برای والدین و فرزندان به صورت مشترک",
        image: gardnerImage,
        time: "60",
        participants: 241,
        questionsCount: 60,
        target_audience: "ویژه والدین و فرزندان",
        category: "اختلال خواندن",
        age_range: "3-18",
        price: "45000000",
        rating: "3.4",
        suitableFor: [
            "نوجوانان مضطرب",
            "والدین دغدغه‌مند",
            "روانشناسان کودک",
            "مشاوران مدرسه"
        ],
        reviews: [
            { name: "آرمیتا احمدی", comment: "خیلی مفید و کاربردی بود." },
            { name: "آرمیتا احمدی", comment: "امتحانش آسان بود و نتیجه دقیق داشت." },
            { name: "آرمیتا احمدی", comment: "به نوجوانان پیشنهاد می‌کنم." },
            { name: "آرمیتا احمدی", comment: "سوالات چالش‌برانگیز بودند." },
            { name: "آرمیتا احمدی", comment: "نتیجه‌اش به من کمک کرد." }
        ],
        created_at: "2025-07-15T04:47:07Z",
    },
];