import podcastCover from "../assets/images/banner/pod.webp"
import podcast from "../assets/audio/SoundHelix-Song-1.mp3"

export const podcastData = [
    {
        id: 1,
        title: "چطور با اضطراب کنار بیاییم؟",
        description: `در این قسمت از پادکست، به بررسی عمیق و علمی اضطراب می‌پردازیم؛ از ریشه‌ها و علل ایجاد آن گرفته تا تاثیراتی که روی زندگی روزمره ما می‌گذارد. اضطراب یک پاسخ طبیعی به شرایط استرس‌زا است، اما زمانی که کنترل‌نشده باقی بماند، می‌تواند کیفیت زندگی را به شدت کاهش دهد.
ما در این گفتگو با الهام عباسی، روان‌شناس و مشاور متخصص، به روش‌های مؤثر مدیریت اضطراب، تمرینات عملی کاهش استرس و تغییر نگرش نسبت به ترس‌ها و نگرانی‌ها می‌پردازیم.
این قسمت به شما کمک می‌کند که با شناخت بهتر اضطراب، ابزارهای کاربردی برای مقابله با آن پیدا کنید و زندگی آرام‌تر و با کیفیت‌تری را تجربه نمایید. چه اگر خودتان اضطراب را تجربه می‌کنید و چه اگر به دنبال درک بهتر اطرافیانتان هستید، این قسمت برای شما مفید خواهد بود.
همچنین، توصیه‌ها و نکات کلیدی برای حفظ سلامت روان و افزایش تاب‌آوری در برابر فشارهای روزمره ارائه می‌شود.
در نهایت، تلاش می‌کنیم نگاه علمی و انسانی را در کنار هم داشته باشیم تا راهکارهای واقعی و قابل اجرا را به شما منتقل کنیم.
با ما همراه باشید تا قدم به قدم مسیر بهبود را با هم طی کنیم.`,
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "27:45",
        publishDate: "2024-06-10",
        guests: ["الهام عباسی"],
        tags: ["روان‌شناسی", "اضطراب", "مدیریت احساسات"]
    },
    {
        id: 2,
        title: "رازهای رشد فردی",
        description: `در این قسمت از پادکست، به بررسی عمیق و علمی اضطراب می‌پردازیم؛ از ریشه‌ها و علل ایجاد آن گرفته تا تاثیراتی که روی زندگی روزمره ما می‌گذارد. اضطراب یک پاسخ طبیعی به شرایط استرس‌زا است، اما زمانی که کنترل‌نشده باقی بماند، می‌تواند کیفیت زندگی را به شدت کاهش دهد.
ما در این گفتگو با الهام عباسی، روان‌شناس و مشاور متخصص، به روش‌های مؤثر مدیریت اضطراب، تمرینات عملی کاهش استرس و تغییر نگرش نسبت به ترس‌ها و نگرانی‌ها می‌پردازیم.
این قسمت به شما کمک می‌کند که با شناخت بهتر اضطراب، ابزارهای کاربردی برای مقابله با آن پیدا کنید و زندگی آرام‌تر و با کیفیت‌تری را تجربه نمایید. چه اگر خودتان اضطراب را تجربه می‌کنید و چه اگر به دنبال درک بهتر اطرافیانتان هستید، این قسمت برای شما مفید خواهد بود.
همچنین، توصیه‌ها و نکات کلیدی برای حفظ سلامت روان و افزایش تاب‌آوری در برابر فشارهای روزمره ارائه می‌شود.
در نهایت، تلاش می‌کنیم نگاه علمی و انسانی را در کنار هم داشته باشیم تا راهکارهای واقعی و قابل اجرا را به شما منتقل کنیم.
با ما همراه باشید تا قدم به قدم مسیر بهبود را با هم طی کنیم.`,
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "33:21",
        publishDate: "2024-06-18",
        guests: ["دکنر احمدی"],
        tags: ["رشد فردی", "سبک زندگی"]
    },
    {
        id: 3,
        title: "چطور خواب بهتری داشته باشیم؟",
        description: "در این قسمت به تکنیک‌های علمی برای بهبود کیفیت خواب می‌پردازیم.",
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "21:07",
        publishDate: "2024-07-01",
        guests: ["دکتر رستمی"],
        tags: ["سلامت روان", "خواب"]
    },
    {
        id: 4,
        title: "چطور با اضطراب کنار بیاییم؟",
        description: "در این قسمت درباره‌ی اضطراب، ریشه‌ها و روش‌های مدیریت آن صحبت می‌کنیم.",
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "27:45",
        publishDate: "2024-06-10",
        guests: ["الهام عباسی"],
        tags: ["روان‌شناسی", "اضطراب", "مدیریت احساسات"]
    },
    {
        id: 5,
        title: "رازهای رشد فردی",
        description: `در این قسمت از پادکست، به بررسی عمیق و علمی اضطراب می‌پردازیم؛ از ریشه‌ها و علل ایجاد آن گرفته تا تاثیراتی که روی زندگی روزمره ما می‌گذارد. اضطراب یک پاسخ طبیعی به شرایط استرس‌زا است، اما زمانی که کنترل‌نشده باقی بماند، می‌تواند کیفیت زندگی را به شدت کاهش دهد.
ما در این گفتگو با الهام عباسی، روان‌شناس و مشاور متخصص، به روش‌های مؤثر مدیریت اضطراب، تمرینات عملی کاهش استرس و تغییر نگرش نسبت به ترس‌ها و نگرانی‌ها می‌پردازیم.
این قسمت به شما کمک می‌کند که با شناخت بهتر اضطراب، ابزارهای کاربردی برای مقابله با آن پیدا کنید و زندگی آرام‌تر و با کیفیت‌تری را تجربه نمایید. چه اگر خودتان اضطراب را تجربه می‌کنید و چه اگر به دنبال درک بهتر اطرافیانتان هستید، این قسمت برای شما مفید خواهد بود.
همچنین، توصیه‌ها و نکات کلیدی برای حفظ سلامت روان و افزایش تاب‌آوری در برابر فشارهای روزمره ارائه می‌شود.
در نهایت، تلاش می‌کنیم نگاه علمی و انسانی را در کنار هم داشته باشیم تا راهکارهای واقعی و قابل اجرا را به شما منتقل کنیم.
با ما همراه باشید تا قدم به قدم مسیر بهبود را با هم طی کنیم.`,
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "33:21",
        publishDate: "2024-06-18",
        guests: ["دکنر احمدی"],
        tags: ["رشد فردی", "سبک زندگی"]
    },
    {
        id: 6,
        title: "چطور خواب بهتری داشته باشیم؟",
        description: "در این قسمت به تکنیک‌های علمی برای بهبود کیفیت خواب می‌پردازیم.",
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "21:07",
        publishDate: "2024-07-01",
        guests: ["دکتر رستمی"],
        tags: ["سلامت روان", "خواب"]
    }, {
        id: 7,
        title: "چطور با اضطراب کنار بیاییم؟",
        description: "در این قسمت درباره‌ی اضطراب، ریشه‌ها و روش‌های مدیریت آن صحبت می‌کنیم.",
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "27:45",
        publishDate: "2024-06-10",
        guests: ["الهام عباسی"],
        tags: ["روان‌شناسی", "اضطراب", "مدیریت احساسات"]
    },
    {
        id: 8,
        title: "رازهای رشد فردی",
        description: "با تمرین‌هایی ساده می‌تونیم به رشد فردی برسیم. توی این قسمت بیشتر توضیح می‌دیم.",
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "33:21",
        publishDate: "2024-06-18",
        guests: ["دکنر احمدی"],
        tags: ["رشد فردی", "سبک زندگی"]
    },
    {
        id: 9,
        title: "چطور خواب بهتری داشته باشیم؟",
        description: "در این قسمت به تکنیک‌های علمی برای بهبود کیفیت خواب می‌پردازیم.",
        audioUrl: podcast,
        coverImage: podcastCover,
        duration: "21:07",
        publishDate: "2024-07-01",
        guests: ["دکتر رستمی"],
        tags: ["سلامت روان", "خواب"]
    }
];
