export const testsFilterConfig = {
    badges: {
        title: "نوع آزمون",
        options: ["ویژه والدین و فرزندان", "ویژه فرزندان", "ویژه والدین"],
    },
    sortOptions: {
        title: "مرتب‌سازی بر اساس",
        options: ["بیشترین امتیاز", "بیشترین انجام", "قیمت"],
    },
    categories: {
        title: "دسته‌بندی آزمون",
        options: ["خانواده", "سبک زندگی", "شخصیت شتاسی", "اضطراب", "اختلالات رفتاری"],
    },
};

export const coursesFilterConfig = {
    badges: {
        title: "نوع دوره",
        options: ["ویژه والدین و فرزندان", "ویژه فرزندان", "ویژه والدین"],
    },
    sortOptions: {
        title: "مرتب‌سازی بر اساس",
        options: ["بیشترین امتیاز", "بیشترین انجام", "قیمت"],
    },
    categories: {
        title: "دسته‌بندی دوره",
        options: ["خانواده", "سبک زندگی", "شخصیت شتاسی", "اضطراب", "اختلالات رفتاری"],
    },
};
